---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplayModel.EnableSilhouettes
source: html/c7e778d9-be11-c66a-5118-4599d3a20795.htm
---
# Autodesk.Revit.DB.ViewDisplayModel.EnableSilhouettes Property

True to show silhouettes edges. False to disable showing them.

## Syntax (C#)
```csharp
public bool EnableSilhouettes { get; set; }
```